Revit 2024 API
BuiltInFailures.AnalyticalModelFailures Class
 Failures about AnalyticalModel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class AnalyticalModelFailures
Visual Basic
Public NotInheritable Class AnalyticalModelFailures
Visual C++
public ref class AnalyticalModelFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures
See Also
BuiltInFailures.AnalyticalModelFailures Members
Autodesk.Revit.DB Namespace